#+begin_src emacs-lisp :exports none
;; -*- lexical-binding: t; no-byte-compile: t; coding: utf-8 -*-
;;; package --- org mode configuration
;;;
;;; Commentary
;;; DO NOT EDIT THIS FILE DIRECTLY
;;; This is a file generated from a literate programing source file
;;; ORG mode configuration
;;; Filename   : org-config.el
;;; Description: ORG mode configuration and customization
;;               Predominantly used for pdf docs and presentations
;;; Date               :
;;; Last Modified Date :
;;
;; shell command execution example (C-c C-c) also include in export
;; #+begin_src sh :results output :exports both
;;   df -Ph
;; #+end_src
;;
;; Installation of minted.sty
;; In order to have that tex convert to pdf, you have to ensure that you have
;; minted.sty in your TEXMF folder.
;;  - To know if minted.sty in correct path do "kpsewhich minted.sty".
;;  - If it is not found, download from
;;          http://www.ctan.org/tex-archive/macros/latex/contrib/minted
;;  - Generate minted.sty by "tex minted.ins"
;;  - To know your TEXMF folder, do "kpsewhich -var-value=TEXMFHOME"
;;  - if folder is ~/texmf
;;  - Move the minted.sty to your $TEXMF/tex/latex/commonstuff folder.
;;  - Do mkdir -p ~/texmf/tex/latex/commonstuff if that folder hierarchy doesn't exist
;;  - Do "mktexlsr" to refresh the sty database
;;  - Generate pdf from the Org exported tex by "pdflatex -shell-escape FILE.tex"
;;
;;  - Help and References
;;      https://sqrtminusone.xyz/configs/emacs/#
;;      https://karthinks.com/software/latex-input-for-impatient-scholars/
;;      https://github.com/vikasrawal/orgpaper
;;      https://github.com/vikasrawal/endingmalnutrition
;;      https://nakkaya.com/2010/09/07/writing-papers-using-org-mode/
;;      https://orgmode.org/worg/org-tutorials/org-latex-export.html
;;      https://www.sharelatex.com/learn
;;      https://en.wikibooks.org/wiki/LaTeX
;;      https://github.com/dfeich/org-babel-examples
*** Rust for orgmode babel

~ob-rust~ enables ~Org-Babel~ support for evaluating Rust code. It was created
based on the usage of ~ob-C~ and ~ob-go~.

#+begin_src emacs-lisp :lexical no
;; org-babel support for evaluating rust code.
(use-package ob-rust
  :defer t
  :quelpa
  (:fetcher github :repo "https://github.com/micanzhang/ob-rust")
  :hook
  (org-mode . aqua/ob-rust-setup)
  :preface
  (defun aqua/ob-rust-setup ()
    (require 'ob-rust)))
#+end_src

Usage of =ob-rust= for embedding the *Rust* code into =org-mode= documents:

#+begin_src rust :tangle no
fn main() {
    let greetings = ["Hello", "Hola", "Bonjour",
                     "Ciao", "こんにちは", "안녕하세요",
                     "Cześć", "Olá", "Здравствуйте",
                     "chào bạn", "您好"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 =>  println!("This code is editable and runnable!"),
            1 =>  println!("Este código es editable y ejecutable!"),
            2 =>  println!("Ce code est modifiable et exécutable!"),
            3 =>  println!("Questo codice è modificabile ed eseguibile!"),
            4 =>  println!("このコードは編集して実行出来ます！"),
            5 =>  println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            6 =>  println!("Ten kod można edytować oraz uruchomić!"),
            7 =>  println!("Esse código é editável e executável!"),
            8 =>  println!("Этот код можно отредактировать и запустить!"),
            9 =>  println!("Bạn có thể edit và run code trực tiếp!"),
            10 =>  println!("这段代码是可以编辑并且能够运行的！"),
            _ =>  {},
        }
    }
}
#+end_src

#+RESULTS:
#+BEGIN_EXAMPLE
Hello : This code is editable and runnable!
Hola : Este código es editable y ejecutable!
Bonjour : Ce code est modifiable et exécutable!
Ciao : Questo codice è modificabile ed eseguibile!
こんにちは : このコードは編集して実行出来ます！
안녕하세요 : 여기에서 코드를 수정하고 실행할 수 있습니다!
Cześć : Ten kod można edytować oraz uruchomić!
Olá : Esse código é editável e executável!
Здравствуйте : Этот код можно отредактировать и запустить!
chào bạn : Bạn có thể edit và run code trực tiếp!
您好 : 这段代码是可以编辑并且能够运行的！
#+END_EXAMPLE

*** Python babel support

Provide python support through ~ob-python~ and ~ob-ipython~.

#+begin_src emacs-lisp
;; python3 support
(setq org-babel-python-command "python3")
;; (setq org-babel-python-command "ipython3 --no-banner --classic --no-confirm-exit")

;; ipython support
(use-package ob-ipython
  :after org
  :init
  ;; for now disabling elpy only for ob-ipython minor mode
  ;; what we should actually do, is just to ensure that
  ;; ob-ipython's company backend comes before elpy's (TODO)
  ;; (add-to-list 'company-backends 'company-ob-ipython)
  (add-hook 'ob-ipython-mode-hookp
            (lambda ()
              (elpy-mode 0)
              (company-mode 1))))

;; use the python lexer for ipython blocks, add this setting
;; this is needed for hghlighting the ipython code block
;; (add-to-list 'org-latex-minted-langs '(ipython "python"))
#+end_src

#+begin_src emacs-lisp :tangle no
;; ob-python for python babel code
;; Babel Functions for Python
(use-package ob-python
  :ensure nil
  :after (ob python)
  :config
  (setq org-babel-python-command python-shell-interpreter))
#+end_src

#+begin_example
 babel for ipython/python
 one can use differen versions of the same language in code blocks
 with python3

 #+begin_src emacs-lisp :results none
 (setq org-babel-python-command "python3")
 #+end_src

 #+begin_src python :results output
 import sys
 print(sys.version)
 #+end_src

 #+RESULTS:
 : >>> >>> >>> >>> 3.9.13 (main, May 24 2022, 21:13:51)
 : [Clang 13.1.6 (clang-1316.0.21.2)]
#+end_example

